package kakaoBlindTest2022;

public class q4 {
	class Solution {
	    /*
	     1. k점의 과녁에 어피치가 a발, 라이언이 b발을 맞혔을 경우 더 많은 화살을 k점에 맞힌 선수가 k점을 가져간다.
	     2. k점을 여러발 맞혀도 k점 보다 더 많은 점수를 가져가는 것이 아니고, k점만 가져간다.
	     3. 라이언과 어피치 모두 k점에 단 하나의 화살도 맞히지 못한 경우 k점을 가져가지 못함
	     4. 라이언과 어피치 모두 같은 과녁에 같은 화살의 개수만큼 맞혔을 경우 어피치가 득점
	     5. 최종 점수가 높은 선수를 우승자로 결정, 단 최종 점수가 같을 경우 어피치가 우승자
	     6. 어피치가 N발 먼저 쏘고 라이언이 쏜다.
	     
	     라이언은 어피치를 가장 큰 점수 차이로 이기기 위해서 n발의 화살을 어떤 과녁 점수에 맞혀야 하는지를 구하려고 한다.
	     
	     라이언이 우승할 수 없는 경우(지거나, 비기는 경우)는 -1을 리턴
	    */
	    public int[] solution(int n, int[] info) {
	        int[] answer = {};
	        return answer;
	    }
	}
}
